Repository: vaseeeeek/my-site
Catalog: *-apps/menu/locale/*/LC_MESSAGES/menu.po
Languages: ru_ru

source: Extended menu
ru_ru: Управление меню

source: This app allows you to create multiply different menus. You can use them at your website frontend.
ru_ru: С помощью приложения вы можете создать и настроить различные меню для фронтенда вашего сайта.

source: If your theme doesn't support this app by default you will need some basics HTML skills.
ru_ru: Если ваша тема дизайна не поддерживает приложение по умолчанию, то вам потребуются базовые знания HTML-вёрстки, чтобы модифицировать шаблоны.

source: The next code can be used to get an array of menu items.
ru_ru: При помощи следующего кода можно получить массив элементов определённого меню.

source: Please note that <code><strong>$menu_id</strong></code> is a concrete menu ID (see "Examples" section below).
ru_ru: Обратите внимание, что <code><strong>$menu_id</strong></code> &mdash; это ID определённого меню (см. секцию "Примеры").

source: Next step is creating th HTML structure of your menu. The simplest way to do this is <code><a href="https://developers.webasyst.com/templates/smarty-plugins/#method-wa_print_tree" target="_blank">wa_print_tree</a></code> function:
ru_ru: Следующий шаг &mdash; создать HTML структуру вашего меню. Самый простой способ это сделать &mdash; использовать функцию <code><a href="https://developers.webasyst.ru/templates/smarty-plugins/#method-wa_print_tree" target="_blank">wa_print_tree</a></code>:

source: It will build folded UL-tags list structure.
ru_ru: Она выведет вложенную структуру UL списков.

source: A little more advanced way is to use Smarty <code><a href="https://www.smarty.net/docsv2/en/language.function.foreach.tpl" target="_blank ">foreach</a></code> loops.
ru_ru: Немного более продвинутый способ &mdash; использовать циклы Smarty, например <code><a href="https://www.smarty.net/docsv2/ru/language.function.foreach.tpl" target="_blank ">foreach</a></code>.

source: top level items loop
ru_ru: цикл по элементам верхнего уровня

source: render link
ru_ru: отрисовка ссылки

source: the item ma have some children
ru_ru: у элемента могут быть вложенные элементы

source: second level items loop
ru_ru: цикл по элементам второго уровня

source: here can be some more children: {$child.childs} etc.
ru_ru: далее могут быть ещё вложенные элементы: {$child.childs} и т.д.

source: Cache
ru_ru: Кэш

source: This app uses cache to reduce server load. You can change cache life time at the <a href="#/settings/">settings page</a>.
ru_ru: В приложении используется кеш для снижения нагрузки на сервер. Вы можете изменить время жизни кеша на <a href="#/settings/">странице настроек</a>.

source: File cache is used by default. But you can change cache settings of your Webasyst follow by this guide:
ru_ru: По умолчанию используется файловый кеш. Но следуя этому руководству вы можете изменить настройки кэша вашего Webasyst:

source: https://developers.webasyst.com/features/cache/
ru_ru: https://developers.webasyst.ru/features/cache/

source: Examples
ru_ru: Примеры

source: You have no menus yet. Please use the link at the left sidebar to create a new one.
ru_ru: У вас пока нет меню. Создать новое меню вы можете по клику на ссылку в левом сайдбаре.

source: Select menu to render the structure.
ru_ru: Выберите меню для отрисовки его структуры.

source: Name
ru_ru: Название

source: Type
ru_ru: Тип

source: Enabled
ru_ru: Включен

source: delete
ru_ru: удалить

source: Save
ru_ru: Сохранить

source: This will permanently delete item and all its sub-items without the ability to recover. Are you sure?
ru_ru: Элемент меню и все вложенные элементы будут удалены безвозвратно. Продолжить?

source: settings
ru_ru: настройки

source: New item
ru_ru: Новый пункт меню

source: Select menu item to change settings.
ru_ru: Для изменения настроек выберите пункт меню.

source: Copied
ru_ru: Скопировано

source: Icon
ru_ru: Иконка

source: Code
ru_ru: Код

source: Result
ru_ru: Результат

source: Menu not found
ru_ru: Меню не найдено

source: Settings
ru_ru: Настройки

source: Cache lifetime
ru_ru: Время жизни кэша

source: Menu cache lifetime value (in seconds).
ru_ru: Время жизни кэша меню (в сек.)

source: Info
ru_ru: Информация

source: Add menu
ru_ru: Добавить меню

source: Item not found
ru_ru: Пункт меню не найден

source: test
ru_ru: тест

source: Item couldn't be inserted before itself
ru_ru: Невозможно добавить пункт перед самим собой

source: Item couldn't be parent of itself
ru_ru: Пункт меню не может быть родительским для себя самого

source: Before item couldn't be parent item
ru_ru: Невозможно добавить родительский элемент

source: Empty request.
ru_ru: Пустой запрос.

source: New menu
ru_ru: Новое меню

source: Target
ru_ru: Цель

source: New tab
ru_ru: Новая вкладка (_blank)

source: Current tab
ru_ru: Текущая вкладка (_current)

source: Parent window
ru_ru: Родительская вкладка (_parent)

source: Top frame
ru_ru: Родительский фрейм (_top)

source: Simple link
ru_ru: Обычная ссылка

source: Error
ru_ru: Ошибка

source: Close
ru_ru: Закрыть

source: Saved
ru_ru: Сохранено

source: or
ru_ru: или

source: cancel
ru_ru: отмена

source: An error occurred.
ru_ru: Произошла ошибка.

source: This will permanently delete menu and all its items without the ability to recover. Are you sure?
ru_ru: Меню и все его элементы будут удалены безвозвратно. Продолжить?

source: Plugins
ru_ru: Плагины

source: filter menus
ru_ru: фильтр меню

source: Backend menu sorting
ru_ru: Сортировка меню в бекенде

source: Refresh page to apply this setting.
ru_ru: Для изменения сортировки в боковом меню обновите страницу.
