Repository: vaseeeeek/my-site
Catalog: *-plugins/shipping/worldwide/locale/*/LC_MESSAGES/shipping_worldwide.po
Languages: ru_ru

source: Worldwide
ru_ru: Международная доставка

source: Transit time
ru_ru: Время в пути

source: Currency
ru_ru: Валюта

source: Weight dimension unit
ru_ru: Единица измерения веса

source: kg
ru_ru: кг

source: lbs
ru_ru: фунт

source: Delivery rates
ru_ru: Тарифы

source: Destination
ru_ru: Пункт назначения

source: Add country
ru_ru: Добавить страну

source: All countries
ru_ru: Все страны

source: All European countries
ru_ru: Все европейские страны

source: Rest of world
ru_ru: Остальные страны

source: Add
ru_ru: Добавить

source: Same day
ru_ru: Этот же день

source: Next day
ru_ru: Следующий день

source: 2-3 days
ru_ru: 2–3 дня

source: 1 week
ru_ru: 1 неделя

source: Undefined
ru_ru: Не определено

source: Reliable international delivery tailored to local conditions.
ru_ru: Доставка в любую точку мира по доступным ценам.

source: 2 weeks
ru_ru: 2 недели

source: 2-3 weeks
ru_ru: 2–3 недели

source: 2-4 weeks
ru_ru: 2–4 недели

source: 4-6 weeks
ru_ru: 4–6 недели

source: 4-8 weeks
ru_ru: 4–8 недели

source: 2-3 months
ru_ru: 2–3 месяца

source: Package weight exceeds maximum allowed weight
ru_ru: Вес отправления превышает максимально допустимый

source: Shipping to this region will not be offered.
ru_ru: Доставка в этот регион невозможна.

source: Same rate for any package weight
ru_ru: Единый тариф для любого веса отправления

source: Define rates by package weight...
ru_ru: Стоимость доставки зависит от веса...

source: No international shipping rates defined yet.
ru_ru: Не определено ни одного тарифа.

source: Add weight
ru_ru: Добавить

source: Shipping service name
ru_ru: Название службы доставки

source: Enter optional shipping service name which will be shown to customers next to this shipping option
ru_ru: Введите необязательное название службы доставки, которое будет показано покупателю рядом с этим вариантом доставки

source: Store country
ru_ru: Страна магазина

source: Select a country within which worldwide shipping should not be available.
ru_ru: Выберите страну, в пределах которой не должна быть доступна международная доставка.
