Repository: vaseeeeek/my-site
Catalog: *-apps/menu/plugins/shop/locale/*/LC_MESSAGES/menu_shop.po
Languages: ru_ru

source: Category
ru_ru: Категория

source: Shop
ru_ru: Магазин

source: Additional menu item types
ru_ru: Дополнительные типы меню

source: Include subcategories
ru_ru: Вывод подкатегорий

source: All children
ru_ru: Все дочерние категории

source: 1 level depth (direct children only)
ru_ru: 1 уровень вложенности (только прямые дочерние)

source: 2 level depth
ru_ru: 2 уровень вложенности

source: 3 level depth
ru_ru: 3 уровень вложенности

source: Don't include
ru_ru: Не выводить

source: App "Shop" required.
ru_ru: Необходимо приложение &laquo;Магазин&raquo;

source: Link to a category
ru_ru: Ссылка на категорию

source: Categories subtree
ru_ru: Геренерация дерева категорий

source: Link to a product
ru_ru: Ссылка на товар

source: Link to a shop page
ru_ru: Ссылка на страницу магазина
